"У вас есть список numbers. Напишите программу, которая заполняет список числами от 0 до 100 и выводит его на экран."

numbers = []
for i in range(100 +1):
    numbers.append(i)

print(numbers)